app/views/records/index.html.erb

INSERT INTO "records" ("check_out_date", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["check_out_date", Mon, 30 Dec 2013], ["created_at", Sun, 29 Dec 2013 16:27:51 UTC +00:00], ["updated_at", Sun, 29 Dec 2013 16:27:51 UTC +00:00], ["user_id", 2]]
---
        <td><%= record.check_in_date %></td>
        <td><%=l record.created_at %></td>