app/views/records/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1
---
        <td><%= Book.find(record.book_id).name %></td>
        <td><%= User.find(record.user_id).email %></td>