app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.recommended_by = current_user.email
    @book.status = 'To buy'
    if @book.save
---
INSERT INTO "books" ("author", "created_at", "isbn", "name", "note", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", ""], ["created_at", Sun, 22 Dec 2013 03:44:56 UTC +00:00], ["isbn", ""], ["name", "123"], ["note", ""], ["updated_at", Sun, 22 Dec 2013 03:44:56 UTC +00:00]]

  def show
    @book = Book.find(params[:id])
    @user = User.find(current_user.id)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1

  def update
    @book = Book.find(params[:id])

    if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "books" SET "isbn" = ?, "updated_at" = ? WHERE "books"."id" = 1  [["isbn", "9787111374046"], ["updated_at", Sun, 29 Dec 2013 15:23:34 UTC +00:00]]