app/controllers/records_controller.rb

INSERT INTO "records" ("book_id", "check_out_date", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["book_id", 2], ["check_out_date", Wed, 25 Dec 2013], ["created_at", Wed, 25 Dec 2013 15:24:20 UTC +00:00], ["updated_at", Wed, 25 Dec 2013 15:24:20 UTC +00:00], ["user_id", 2]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "2"]]
---
  def create
    @record = Record.new(record_params)
    if @record.save
      @book = Book.find(@record.book_id)

SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "records" WHERE "records"."id" = ?  [["id", 1]]
---
  def destroy
    @record = Record.find(params[:id])
    @record.destroy

SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", "29"]]
---
  def edit
    @record = Record.find(params[:id])

SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", "29"]]
UPDATE "records" SET "check_in_date" = ?, "updated_at" = ? WHERE "records"."id" = 33  [["check_in_date", Mon, 30 Dec 2013], ["updated_at", Sun, 29 Dec 2013 18:18:55 UTC +00:00]]
---
  def update
    @record = Record.find(params[:id])
    @record.update(record_params)